todo-api/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY created_at DESC
---
  def index
    todos = Todo.order("created_at DESC")

INSERT INTO "todos" ("title", "done", "important", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["done", 0], ["important", 0], ["created_at", "2019-03-10 11:42:20.237924"], ["updated_at", "2019-03-10 11:42:20.237924"]]
---
  def create
    todo = Todo.create(allowed_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "important" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["important", 1], ["updated_at", "2019-03-10 12:11:21.219775"], ["id", 3]]
---
  def update
    todo = Todo.find(params[:id])
    todo.update_attributes(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
---
  def destroy
    todo = Todo.find(params[:id])
    todo.destroy